#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-KyiTouLx9urLxVne

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_droplet_snapshot.original-main-snapshot: Refreshing state... [id=126133672]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_ssh_key.secondary: Refreshing state... [id=38557683]
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_ssh_key.tara: Refreshing state... [id=38240725]
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_droplet.secondary: Refreshing state... [id=332540871]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_droplet.postgres: Refreshing state... [id=359948759]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
module.remote_state.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
module.postgres_backups.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.configuration_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-sfvz2s]
data.aws_iam_policy_document.ec2_assume_role: Refreshing...
data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_role.ec2_primary: Refreshing state... [id=ec2-primary]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_instance_profile.ec2_primary: Refreshing state... [id=ec2-profile]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_security_group.inbound_http: Refreshing state... [id=sg-0a04ba8fd38ce68c9]
aws_security_group.https: Refreshing state... [id=sg-0a3410176c57a9dcb]
aws_security_group.http: Refreshing state... [id=sg-065a412fecefab781]
aws_security_group.ssh: Refreshing state... [id=sg-07a113216ea602a4f]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1461435279]
aws_security_group_rule.allow_ephemeral_ssh_return: Refreshing state... [id=sgrule-139332016]
aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3725321253]
aws_security_group_rule.allow_outbound_https_return: Refreshing state... [id=sgrule-691814140]
aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-3902821458]
aws_security_group_rule.allow_outbound_http_return: Refreshing state... [id=sgrule-4180701166]
module.configuration_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-sfvz2s]
aws_security_group_rule.allow_inbound_http: Refreshing state... [id=sgrule-3784435258]
aws_instance.primary: Refreshing state... [id=i-027e1e5cced36b0fb]
aws_iam_policy.ec2_primary: Refreshing state... [id=arn:aws:iam::558855412466:policy/ec2-primary-policy]
module.remote_state.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
module.postgres_backups.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-tr1pjq]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
aws_iam_role_policy_attachment.ec2_primary: Refreshing state... [id=ec2-primary-20230806154009241400000001]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
aws_eip.primary: Refreshing state... [id=eipalloc-0df438faa35a069af]
aws_security_group.inbound_http: Drift detected (update)
aws_security_group.ssh: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group_rule.allow_ephemeral_http_return will be created
  + resource "aws_security_group_rule" "allow_ephemeral_http_return" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow ephemeral HTTP traffic return"
      + from_port                = 1024
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0a04ba8fd38ce68c9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # aws_security_group_rule.allow_inbound_http must be replaced
-/+ resource "aws_security_group_rule" "allow_inbound_http" {
      ~ id                       = "sgrule-3784435258" -> (known after apply)
      ~ security_group_id        = "sg-07a113216ea602a4f" -> "sg-0a04ba8fd38ce68c9"
      ~ security_group_rule_id   = "sgr-0179c0a53dd856d42" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

</details>